import { Chevron } from '@core';
import { useState } from 'react';
import { twMerge } from 'tailwind-merge';

export const FAQ = () => {
	const [selectedQuestions, setSelectedQuestions] = useState<number[]>([0]);

	const questions = [
		'Насколько точны ваши расчеты?',
		'Можно ли использовать ваши расчеты для официальной экспертизы?',
		'Какие нормы вы используете для расчетов?',
		'Поддерживает ли ваш cервис расчеты для нестандартных конструкций',
		'Можно ли интегрировать ваши расчеты с программами CAD/BIM?',
		'Каковы ограничения бесплатной версии?',
		'Как часто обновляется база данных материалов и нормативов?',
		'Как можно получить техническую поддержку?',
		'В чем разница между тарифными планами?',
	];

	const descriptions = [
		'Наши алгоритмы регулярно проходят проверку в лаборатории БелНИИС и соответствуют всем актуальным нормативам, что гарантирует их высокую точность.',
		'Да, наши расчеты принимаются экспертизой. Для дополнительной уверенности вы можете заказать проверку у наших сертифицированных инженеров.',
		'Мы выполняем расчёты в строгом соответствии с действующими строительными нормами, включая: Теплотехника: СП 50.13330.2012 «Тепловая защита зданий» Звукоизоляция: СП 51.13330.2011 «Защита от шума» и СП 275.1325800.2016 «Здания и сооружения. Метод расчета звукоизоляции ограждающих конструкций от воздушного шума» Пожарная безопасность: СП 2.13130.2020 «Системы противопожарной защиты. Обеспечение огнестойкости объектов защиты. Общие требования» и СП 12.13130.2009 «Определение категорий помещений, зданий и наружных установок по взрывопожарной и пожарной опасности» Геометрические параметры: СП 70.13330.2012 «Несущие и ограждающие конструкции. Актуализированная редакция СНиП 3.03.01-87» Это гарантирует надёжность и безопасность ваших проектов.',
		'Да, наши расчеты принимаются экспертизой. Для дополнительной уверенности вы можете заказать проверку у наших сертифицированных инженеров.',
		'Да, интеграция с CAD/BIM доступна в PRO версии (опционально), что упрощает процесс проектирования и документации.',
		'Бесплатная версия включает расчёты для ограниченного числа конструкций, базу материалов с ограниченным доступом и возможность сравнения до двух конструкций.',
		'Мы следим за всеми изменениями в законодательстве и обновляем базу ежемесячно.',
		'Техническая поддержка доступна для всех пользователей, однако в PRO версии предусмотрена приоритетная премиум-поддержка.',
		'Бесплатная: Идеально для ознакомления и небольших проектов. Подходит для выполнения базовых расчётов и тестирования функционала. Стандарт: Оптимальный выбор для регулярного использования. Подходит для тех, кто выполняет расчёты на постоянной основе и нуждается в расширенном доступе к базе материалов. PRO: Максимальные возможности для крупных компаний. Полный доступ ко всем функциям, включая расчёты нестандартных конструкций и интеграцию с CAD/BIM программами.',
	];

	const handleQuestionClick = (index: number) => {
		setSelectedQuestions((prevSelected) =>
			prevSelected.includes(index)
				? prevSelected.filter((i) => i !== index)
				: [...prevSelected, index],
		);
	};

	return (
		<div className="flex w-full justify-center bg-background-primary">
			<div className="flex w-[73.18%] flex-col py-[50px]">
				<div className="mb-[30px] flex font-montserrat text-[20px] font-normal leading-[24px]">
					Часто задаваемые вопросы
				</div>
				<div className="flex flex-col gap-[15px]">
					{questions.map((question, index) => (
						<div
							key={index}
							className={twMerge(
								'flex cursor-pointer flex-row justify-between gap-[10px] overflow-hidden rounded-[20px] bg-white py-[23px] pl-[20px] pr-[45px] transition-all duration-300 ease-in-out',
								selectedQuestions.includes(index) ? 'max-h-[100%]' : 'max-h-[64px]',
							)}
							onClick={() => handleQuestionClick(index)}
						>
							<div className="flex flex-col gap-[40px]">
								<div className="font-montserrat text-[20px] font-semibold leading-[24px]">
									{question}
								</div>
								<div
									key={index}
									className="font-montserrat text-[20px] font-normal leading-[24px]"
								>
									{descriptions[index]}
								</div>
							</div>
							<div className="flex flex-col justify-start">
								<Chevron
									color={selectedQuestions.includes(index) ? 'grey' : 'primary'}
									direction={selectedQuestions.includes(index) ? 'down' : 'right'}
								/>
							</div>
						</div>
					))}
				</div>
			</div>
		</div>
	);
};
