export const questions = [
	'Насколько точны ваши расчеты?',
	'Можно ли использовать ваши расчеты для официальной экспертизы?',
	'Какие нормы вы используете для расчетов?',
	'Поддерживает ли ваш cервис расчеты для нестандартных конструкций',
	'Можно ли интегрировать ваши расчеты с программами CAD/BIM?',
	'Каковы ограничения бесплатной версии?',
	'Как часто обновляется база данных материалов и нормативов?',
	'Как можно получить техническую поддержку?',
	'В чем разница между тарифными планами?',
];

export const descriptions = [
	'Наши алгоритмы регулярно проходят проверку в лаборатории БелНИИС и соответствуют всем актуальным нормативам, что гарантирует их высокую точность.',
	'Да, наши расчеты принимаются экспертизой. Для дополнительной уверенности вы можете заказать проверку у наших сертифицированных инженеров.',
	'Мы выполняем расчёты в строгом соответствии с действующими строительными нормами, включая: \nТеплотехника: СП 50.13330.2012 <i>«Тепловая защита зданий»</i> \nЗвукоизоляция: СП 51.13330.2011 <i>«Защита от шума»</i> и СП 275.1325800.2016 <i>«Здания и сооружения. Метод расчета звукоизоляции ограждающих конструкций от воздушного шума»</i> \nПожарная безопасность: СП 2.13130.2020 <i>«Системы противопожарной защиты. \nОбеспечение огнестойкости объектов защиты. Общие требования»</i> и СП 12.13130.2009 <i>«Определение категорий помещений, зданий и наружных установок по взрывопожарной и пожарной опасности»</i> \nГеометрические параметры: СП 70.13330.2012 <i>«Несущие и ограждающие конструкции. Актуализированная редакция СНиП 3.03.01-87»</i> \nЭто гарантирует надёжность и безопасность ваших проектов.',
	'Да, наши расчеты принимаются экспертизой. Для дополнительной уверенности вы можете заказать проверку у наших сертифицированных инженеров.',
	'Да, интеграция с CAD/BIM доступна в PRO версии (опционально), что упрощает процесс проектирования и документации.',
	'Бесплатная версия включает расчёты для ограниченного числа конструкций, базу материалов с ограниченным доступом и возможность сравнения до двух конструкций.',
	'Мы следим за всеми изменениями в законодательстве и обновляем базу ежемесячно.',
	'Техническая поддержка доступна для всех пользователей, однако в PRO версии предусмотрена приоритетная премиум-поддержка.',
	'Бесплатная: Идеально для ознакомления и небольших проектов. Подходит для выполнения базовых расчётов и тестирования функционала. \nСтандарт: Оптимальный выбор для регулярного использования. Подходит для тех, кто выполняет расчёты на постоянной основе и нуждается в расширенном доступе к базе материалов. \nPRO: Максимальные возможности для крупных компаний. Полный доступ ко всем функциям, включая расчёты нестандартных конструкций и интеграцию с CAD/BIM программами.',
];
