export const steps = [
	'Проектирование. Звукоизоляция.',
	'AI ассистент (3 режима)',
	'Визуализация фасадов и интерьеров',
	'Экспертиза проекта (2 режима)',
	'Аналитика нормативной документации',
];

export const stepDescriptions = [
	'Рассчет звукоизоляции стен и перекрытий по СП 02.04.03-2023 . \n\nГенерирует PDF-отчет с формулами, готовый к подаче на экспертизу.',
	'Общий\n\nДоступ к новейшим моделям ИИ (от Open AI, Antropic, Google, Китайские модели) \n\nАналитика документов PDF \n\nAI проверяет, суммаризирует и структурирует документы. Выдает готовый отчет в DOC/Excel — для смет, ТЗ, протоколов.\n\nDeepResearch (Perplexity Sonar Pro Search)\n\nглубокий поиск информации в интернете со ссылками на первоисточник.',
	'AI-генерация изображений (nano banano 2 pro) с кастомными настройками. Меняйте материалы, мебель, положение камеры и др. в один клик.',
	'"Общая экспертиза"\n\n- Проверяет общую структуру проекта;\n- Проверяет проект на соответствие актуальным ТНПА.\n- Проверка проекта по внутренним требованиям\n\n"Экспертиза звукоизоляции"\n\nАнализ заложенных в проекте решений по звукоизоляции',
	'Выполняет глубокий анализ нормативных документов (СН, СП и др.). Задавайте любые вопросы, система создаст отчет с прямыми ссылками на пункты и страницы документов.',
];

export const stepDetailDescriptions = [
	'Рассчет звукоизоляции стен и перекрытий по СП 02.04.03-2023 . \n\nГенерирует PDF-отчет с формулами, готовый к подаче на экспертизу.',
	'Общий\n\nДоступ к новейшим моделям ИИ (от Open AI, Antropic, Google, Китайские модели) \n\nАналитика документов PDF \n\nAI проверяет, суммаризирует и структурирует документы. Выдает готовый отчет в DOC/Excel — для смет, ТЗ, протоколов.\n\nDeepResearch (Perplexity Sonar Pro Search)\n\nглубокий поиск информации в интернете со ссылками на первоисточник.',
	'AI-генерация изображений (nano banano 2 pro) с кастомными настройками. Меняйте материалы, мебель, положение камеры и др. в один клик.',
	'"Общая экспертиза"\n\n- Проверяет общую структуру проекта;\n- Проверяет проект на соответствие актуальным ТНПА.\n- Проверка проекта по внутренним требованиям\n\n"Экспертиза звукоизоляции"\n\nАнализ заложенных в проекте решений по звукоизоляции',
	'Выполняет глубокий анализ нормативных документов (СН, СП и др.). Задавайте любые вопросы, система создаст отчет с прямыми ссылками на пункты и страницы документов.',
];
