export const steps = [
	'Укажите характеристики вашего проекта',
	'Выберите оптимальные конструкции на основе расчётов',
	'Получите точные расчёты конструкций',
	'Создайте отчет',
	'Пройдите экспертизу',
];

export const stepDescriptions = [
	'Укажите основные характеристики вашего проекта, такие как тип здания, назначение помещений и другие параметры.\n\nЭто позволит системе точно учитывать все необходимые нормы и требования.',
	'Ознакомьтесь с предложенными конструкциями, сравните их по стоимости и параметрам. Это поможет вам выбрать наилучшее решение для вашего проекта.',
	'После выбора конструкций получите подробные расчёты, подтверждающие соответствие проектных решений всем строительным нормам, а также стоимость каждого решения.',
	'Детальные расчеты для выбранной конструкции: все необходимые параметры и данные.\n\nСпецификации материалов, полная информация о материалах.',
	'Отправьте расчеты на проверку нашим сертифицированным инженерам.\n\nПолучите заключение для успешного прохождения государственной экспертизы.',
];
